{
  "candidates": [
    {
      "name": "Angela ",
      "surname": "Merkel ",
      "middlename": "Dorothea",
      "biography": "Angela Dorothea Kasner, better known as Angela Merkel, was born in Hamburg, West Germany, on July 17, 1954. Trained as a physicist, Merkel entered politics after the 1989 fall of the Berlin Wall. Rising to the position of chairwoman of the Christian Democratic Union party, Merkel became Germany's first female chancellor and one of the leading figures of the European Union, following the 2005 national elections.Angela Merkel was reelected for a fourth term as chancellor in September 2017. However, although her CDU party held its majority in the Bundestag, the national parliament, the far-right Alternative for Germany (AfD) won 13 percent of the vote to become the third-largest group in parliament, after the CDU/CSU and SPD. It was the first time a far-right party had entered the Bundestag since 1961.",
      "imageUrl": "http://res.cloudinary.com/dth7rq73s/image/upload/v1678493199/gdwdpxykkpraamky6inp.webp",
      "id": 1
    },
    {
      "name": "Volodymyr ",
      "surname": "Zelenskyy",
      "middlename": "Oleksandrovych ",
      "biography": "Volodymyr Zelensky, also spelled Volodymyr Zelenskyy, (born January 25, 1978, Kryvyy Rih, Ukraine, U.S.S.R. [now in Ukraine]), Ukrainian actor and comedian who was elected president of Ukraine in 2019. Although he was a political novice, Zelensky’s anti-corruption platform won him widespread support, and his significant online following translated into a solid electoral base. He won a landslide victory over incumbent Petro Poroshenko in the second round of the 2019 presidential election. President Zelensky’s leadership during the Russian invasion of Ukraine won him global acclaim.On April 21 Zelensky was elected president of Ukraine with an impressive 73 percent of the vote. Within days the president-elect faced his first foreign policy challenge, when Putin announced his decision to offer Russian passports to the Ukrainian citizens in separatist-controlled areas of war-torn eastern Ukraine. The Russian-backed hybrid war there was entering its fifth year, and hundreds of thousands of Ukrainians had been displaced by the conflict. Zelensky ridiculed the offer, responding with a Facebook post that extended Ukrainian citizenship to Russians and others “who suffer from authoritarian or corrupt regimes.”",
      "imageUrl": "http://res.cloudinary.com/dth7rq73s/image/upload/v1678494535/oedehzbxfu0dkm8ypbon.jpg",
      "id": 10
    },
    {
      "name": "Mikheil",
      "surname": "Saakashvili",
      "middlename": "Mikheil",
      "biography": "Mikheil Saakashvili, Mikheil also spelled Mikhail, (born December 21, 1967, Tbilisi, Georgia, U.S.S.R.), Georgian politician who was instrumental in easing Pres. Eduard Shevardnadze from office and who served as president of Georgia (2004–07, 2008–13). He was later granted Ukrainian citizenship by Ukrainian Pres. Petro Poroshenko and was appointed governor of Odessa (2015–16) before quitting and being stripped of his Ukrainian citizenship. In the January 4, 2004, elections held to replace Shevardnadze, Saakashvili won 96 percent of the vote. He immediately sought solutions for Georgia’s manifold problems by appointing a new slate of government officials and attacking endemic corruption. Most important, however, he focused on keeping the country together in the face of secessionist movements in Georgia’s ethnic republics of Abkhazia, Ajaria, and South Ossetia—a course of action that often led him into conflict with Russian Pres. Vladimir Putin, who supported separatists in those regions. Saakashvili subsequently won the presidential election held on January 5, 2008, but by a significantly smaller majority than he had in 2004. Though opposition groups contested the election as flawed, its results were supported by international monitors, and Saakashvili began his second term as president on January 20. Parliamentary elections were held in late May 2008, with Saakashvili’s UNM winning a majority of the seats.",
      "imageUrl": "http://res.cloudinary.com/dth7rq73s/image/upload/v1678493489/g7u7kretmcmgs54lmxr1.jpg",
      "id": 2
    },
    {
      "name": "Joseph",
      "surname": "Biden ",
      "middlename": "Robinette ",
      "biography": "Joe Biden, byname of Joseph Robinette Biden, Jr., (born November 20, 1942, Scranton, Pennsylvania, U.S.), 46th president of the United States (2021– ) and 47th vice president of the United States (2009–17) in the Democratic administration of Pres. Barack Obama. He previously represented Delaware in the U.S. Senate (1973–2009). Biden remained involved in politics and was a vocal critic of Pres. Donald Trump. Biden himself faced censure when, in 2019, various women accused him of inappropriate physical contact, notably hugging and kissing. Although his response was widely derided—“I’m sorry I didn’t understand more.…I’m not sorry for anything that I have ever done. I’ve never been disrespectful intentionally to a man or a woman”—his popularity remained high. Amid growing speculation that he would run for president in 2020, Biden announced his candidacy in April 2019, joining a crowded Democratic field.",
      "imageUrl": "http://res.cloudinary.com/dth7rq73s/image/upload/v1678493559/n7pfcugtwouzorimevmy.webp",
      "id": 3
    },
    {
      "name": "Emmanuel ",
      "surname": "Macron ",
      "middlename": "Jean-Michel",
      "biography": "Emmanuel Macron, (born December 21, 1977, Amiens, France), French banker and politician who was elected president of France in 2017. Macron was the first person in the history of the Fifth Republic to win the presidency without the backing of either the Socialists or the Gaullists, and he was France’s youngest head of state since Napoleon I. He was reelected in 2022, becoming the first French president in two decades to win a second term.In spite of his administration’s largely effective response to the pandemic, Macron’s approval rating consistently hovered around 40 percent, and his low polling numbers were reflected in the results of the 2021 regional elections. En Marche! failed to capture a single region, while the resurgent Republicans and Socialists dominated across the country. That election saw another record low turnout: just one-third of all eligible voters went to the polls. Voter apathy remained a concern during the 2022 presidential campaign, and Macron struggled to mobilize his remaining supporters. The first round, held on April 10, 2022, was a virtual repeat of the 2017 contest, as Macron captured almost 28 percent of the vote and Le Pen won 23 percent. Mélenchon finished third, with 22 percent, and, although he stopped short of a full endorsement of Macron in the second round, he urged his supporters to “not give a single vote” to Le Pen. In the runoff, held on April 24, Macron secured a second term with more than 58 percent of the vote.",
      "imageUrl": "http://res.cloudinary.com/dth7rq73s/image/upload/v1678493663/dy4z7ci3tacpbw5ywsi4.jpg",
      "id": 4
    },
    {
      "name": "Bashar ",
      "surname": "al-Assad",
      "middlename": "Hafez ",
      "biography": "Bashar al-Assad, (born September 11, 1965, Damascus, Syria), Syrian president from 2000. He succeeded his father, Ḥafiz al-Assad, who had ruled Syria since 1971. In spite of early hopes that his presidency would usher in an era of democratic reform and economic revival, Bashar al-Assad largely continued his father’s authoritarian methods. Beginning in 2011, Assad faced a major uprising in Syria that evolved into civil war.\nMeanwhile, as the conflict was dying down in most of the country, Assad began implementing policies to rebuild Syria. They included projects to build infrastructure and new commercial centres as well as efforts to attract foreign investors. One controversial measure, known as Law 10, allowed the government to seize property if its owners failed to reregister it. The purpose of the law was to allow the development or redistribution of property abandoned during the war by its owners. Many critics noted that the time limit for reclaiming property would disenfranchise many displaced Syrians, who simply could not return in time to reclaim their property, while enabling the government to expropriate property from its opponents en masse and give it to loyalists.",
      "imageUrl": "http://res.cloudinary.com/dth7rq73s/image/upload/v1678493875/ewriejvvyikqukdwoetl.jpg",
      "id": 5
    },
    {
      "name": "Alexander ",
      "surname": "Johnson ",
      "middlename": "Boris de Pfeffel",
      "biography": "Boris Johnson, in full Alexander Boris de Pfeffel Johnson, (born June 19, 1964, New York City, New York, U.S.), American-born British journalist and Conservative Party politician who became prime minister of the United Kingdom in July 2019. He left office in September 2022 after being forced by scandal to resign. Earlier he served as the second elected mayor of London (2008–16) and as secretary of state for foreign affairs (2016–18) under Prime Minister Theresa May.Meanwhile, Johnson remained a persistent critic of May’s attempts to push her version of Brexit through Parliament. After failing twice to win support for her plan in votes in the House of Commons, May, in a closed-door meeting with rank-and-file members of the Conservative Party on March 27, 2019, pledged to step down as prime minister if Parliament approved her plan. This time around, the promise of May’s imminent departure won Johnson’s support for her plan; however, once again it went down to defeat. Having failed to win sufficient support for her plan from Conservatives, unable to negotiate a compromise with the opposition, and assailed by ever more members of her own party, May announced that she would resign as party leader on June 7 but remain as caretaker prime minister until her party had chosen her successor.",
      "imageUrl": "http://res.cloudinary.com/dth7rq73s/image/upload/v1678493941/hpcelg7vcoyvlttz9qzl.jpg",
      "id": 6
    },
    {
      "name": "Barack ",
      "surname": "Obama ",
      "middlename": "Hussein ",
      "biography": "Barack Obama, in full Barack Hussein Obama II, (born August 4, 1961, Honolulu, Hawaii, U.S.), 44th president of the United States (2009–17) and the first African American to hold the office. Before winning the presidency, Obama represented Illinois in the U.S. Senate (2005–08). He was the third African American to be elected to that body since the end of Reconstruction (1877). In 2009 he was awarded the Nobel Peace Prize “for his extraordinary efforts to strengthen international diplomacy and cooperation between peoples.”On August 27 Obama became the first African American to be nominated for the presidency by either major party and went on to challenge Republican Sen. John McCain for the country’s highest office. McCain criticized Obama, still a first-term senator, as being too inexperienced for the job. To counter, Obama selected Joe Biden, a veteran senator from Delaware who had a long resume of foreign policy expertise, to be his vice presidential running mate. Obama and McCain waged a fierce and expensive contest. Obama, still bolstered by a fever of popular support, eschewed federal financing of his campaign and raised hundreds of millions of dollars, much of it coming in small donations and over the Internet from a record number of donors. Obama’s fund-raising advantage helped him buy massive amounts of television advertising and organize deep grassroots organizations in key battleground states and in states that had voted Republican in previous presidential cycles.",
      "imageUrl": "http://res.cloudinary.com/dth7rq73s/image/upload/v1678494016/omhc8z3dypmdjawbrulg.webp",
      "id": 7
    }
  ],
  "comments": [
    {
      "text": "HALALA",
      "commenter": "kdjskdjsk",
      "personID": 12,
      "id": 1
    },
    {
      "text": "Hello mr president",
      "commenter": "Bob maley",
      "personID": 7,
      "id": 2
    },
    {
      "text": "I vote u",
      "commenter": "Ann",
      "personID": 7,
      "id": 3
    },
    {
      "text": "Best president",
      "commenter": "Angel",
      "personID": 7,
      "id": 4
    },
    {
      "text": "Freedom !!! ",
      "commenter": "Gogy ",
      "personID": 2,
      "id": 5
    },
    {
      "text": "BRAVO !!!",
      "commenter": "Bob ",
      "personID": 2,
      "id": 6
    }
  ]
}
